

const Ablution = () => {
return (
    <>
    <section className="my-10 text-center">
        <div className="border border-sky-500 rounded-md mx-10">
            {/* head */}
            <div className="bg-sky-400 text-center rounded-md">
                <h1 className='text-gray-50 text-lg md:text-2xl font-bold py-3'>
            أذكار الوضوء
            </h1>
            </div>
            {/* main */}
                <div className="flex flex-col gap-6 w-full px-6 py-6">
                    {/* Item 1 */}
                <div className="flex flex-row items-stretch bg-white rounded-md shadow">
                {/* Text section on right */}
                <div className="flex-1 flex flex-col justify-center px-3 py-4">
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        الذكر قبل الوضوء
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                قبل الوضوء: "بِسْمِ ٱللّٰهِ  
                    </p>
                </div>
                {/* Number box on left */}
                <div className="flex items-center justify-center rounded-md bg-teal-600 md:w-[120px] w-[50px] md:h-[130px] h-[50px] m-2">
                    <p className="font-bold text-gray-100 md:text-3xl text-lg text-center">
                        1
                    </p>
                </div>
            </div>
                {/* items3 */}
                    {/* Item 2 */}
                <div className="flex flex-row items-stretch bg-white rounded-md shadow">
                {/* Text section on right */}
                <div className="flex-1 flex flex-col justify-center px-3 py-4">
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                    الذكر بعد الوضوء
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                "أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه".
                "اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ".
                "سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ".  
                    </p>
                </div>
                {/* Number box on left */}
                <div className="flex items-center justify-center rounded-md bg-teal-600 md:w-[120px] w-[50px] md:h-[130px] h-[50px] m-2">
                    <p className="font-bold text-gray-100 md:text-3xl text-lg text-center">
                        1
                    </p>
                </div>
            </div>
                {/*  */}
            </div>
        </div>
          {/* article */}
        <article className=" bg-gray-100 border border-red-500 rounded-md my-10 mx-10">
            {/* title */}
            <div className="bg-red-500 rounded-md py-3">
                <h1 className="text-center font-bold md:text-2xl text-lg  text-gray-100">
                    وردك اليوم
                </h1>
            </div>
            {/*  */}
            <div className=" mx-4 my-4 border border-gray-200  p-5">
                <p className=" text-gray-500 md:text-2xl text-lg text-right p-2">
                    حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ الْخُزَاعِيُّ أَخْبَرَنَا وَكِيعٌ عَنْ كَهْمَسِ بْنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ قَالَ أَوَّلُ مَنْ
                    تَكَلَّمَ فِي الْقَدَرِ مَعْبَدٌ الْجُهَنِيُّ قَالَ فَخَرَجْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَتَّى أَتَيْنَا الْمَدِينَةَ فَقُلْنَا لَوْ لَقِينَا رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَاهُ عَمَّا أَحْدَثَ هَؤُلَاءِ الْقَوْمُ قَالَ فَلَقِينَاهُ يَعْنِي عَبْدَ اللَّهِ بْنَ عُمَرَ وَهُوَ خَارِجٌ مِنْ الْمَسْجِدِ قَالَ فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي قَالَ فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلَامَ إِلَيَّ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ قَوْمًا يَقْرَءُونَ الْقُرْآنَ وَيَتَقَفَّرُونَ الْعِلْمَ وَيَزْعُمُونَ أَنْ لَا قَدَرَ وَأَنَّ الْأَمْرَ أُنُفٌ قَالَ فَإِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي مِنْهُمْ بَرِيءٌ وَأَنَّهُمْ مِنِّي بُرَءَاءُ وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللَّهِ لَوْ أَنَّ أَحَدَهُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا مَا قُبِلَ ذَلِكَ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ قَالَ ثُمَّ
                    أَنْشَأَ يُحَدِّثُ فَقَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعَرِ لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ حَتَّى أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَلْزَقَ رُكْبَتَهُ بِرُكْبَتِهِ ثُمَّ قَالَ يَا مُحَمَّدُ مَا الْإِيمَانُ قَالَ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَالْقَدَرِ خَيْرِهِ وَشَرِّهِ قَالَ فَمَا الْإِسْلَامُ قَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَإِقَامُ الصَّلَاةِ وَإِيتَاءُ الزَّكَاةِ وَحَجُّ الْبَيْتِ وَصَوْمُ رَمَضَانَ قَالَ فَمَا الْإِحْسَانُ قَالَ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنَّكَ إِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ قَالَ فِي
                    كُلِّ ذَلِكَ يَقُولُ لَهُ صَدَقْتَ قَالَ فَتَعَجَّبْنَا مِنْهُ يَسْأَلُهُ وَيُصَدِّقُهُ قَالَ فَمَتَى السَّاعَةُ قَالَ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ قَالَ فَمَا أَمَارَتُهَا قَالَ أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ أَصْحَابَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ قَالَ عُمَرُ فَلَقِيَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ بِثَلَاثٍ فَقَالَ يَا 
                    عُمَرُ هَلْ تَدْرِي مَنْ السَّائِلُ ذَاكَ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ مَعَالِمَ دِينِكُمْ حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا كَهْمَسُ بْنُ الْحَسَنِ بِهَذَا الْإِسْنَادِ نَحْوَهُ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ عَنْ كَهْمَسٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ بِمَعْنَاهُ وَفِي 
                    الْبَاب عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ وَأَنَسِ بْنِ مَالِكٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ نَحْوُ هَذَا عَنْ عُمَرَ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالصَّحِيحُ هُوَ ابْنُ عُمَرَ عَنْ عُمَرَ عَنْ النَّبِيِّ.
                </p>
            </div>
        </article>
    </section>
    </>
)
}

export default Ablution
