

const Hajj = () => {
return (
    <>
    <section className="my-10 text-center">
        <div className="border border-sky-500 rounded-md md:mx-10 mx-3">
            {/* head */}
            <div className="bg-sky-400 text-center rounded-md">
                <h1 className='text-gray-50 text-lg md:text-2xl font-bold py-3'>
                أذكار الحج والعمرة
                </h1>
            </div>
            {/* main */}
                <div className="flex flex-col gap-6 w-full px-6 py-6">
                    {/* Item 1 */}
                <div className="flex flex-row items-stretch bg-white rounded-md shadow">
                {/* Text section on right */}
                <div className="flex-1 flex flex-col justify-center md:px-3 py-4">
                    <h1 className="py-2 text-gray-500  md:text-xl font-normal text-right tracking-wide">
                        قد ربط الله تعالى بين الحج والذكر فجعله من أهم مقاصد الركن الخامس من أركان الدين، قال تعالى :
                    </h1>
                    <p className="md:text-xl text-amber-500 text-right">
                        "وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ ". [سورة البقرة - الآية 203]
                    </p>
                    <h1 className="py-2 text-gray-500  md:text-xl font-normal text-right tracking-wide">
                        وقال تعالى :
                    </h1>
                    <p className="md:text-xl text-amber-500 text-right">    
                        "وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالاً وَعَلَى كُلِّ ضَامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ ﴿27﴾ لِيَشْهَدُوا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَعْلُومَاتٍ عَلَى مَا رَزَقَهُمْ مِنْ بَهِيمَةِ الْأَنْعَامِ". [سورة الحج - الآية 28]
                    </p>
                    <h1 className="py-2 text-gray-500  md:text-xl font-normal text-right tracking-wide">
                        فجعل من أهم مقاصد الحج أن يقوم العبد بذكر الله وشكره.
                        وأكد النبي صلى الله عليه وسلم ارتباط الحج بذكر الله فقال صلى الله عليه وسلم:
                    </h1>
                    <p className="md:text-xl text-amber-500 text-right">    
                        " إِنَّمَا جُعِلَ الطَّوَافُ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَرَمْيُ الْجِمَارِ لِإِقَامَةِ ذِكْرِ اللَّهِ". [رواه أبو داود والترمذي]
                    </p>
                    <h1 className="py-2 text-gray-500  md:text-xl font-normal text-right tracking-wide">
                        وهكذا يتجلى شأن الذكر في الحج، ويستبين عظم منزلته ورفيع مكانته. وفيما يلي الأدعية النبوية والأذكار الواردة في محطات الحج ومواقيته الزمانية والمكانية والعمرة والزيارة فاحفظها ليكون حجك مبرورا وسعيك مشكورا.
                    </h1>
                </div>
                {/* Number box on left */}
                <div className="flex items-center justify-center rounded-md bg-teal-600 md:w-[120px] w-[50px] md:h-[400px] h-[50px] m-2">
                    <p className="font-bold text-gray-100 md:text-3xl text-lg text-center">
                        1
                    </p>
                </div>
            </div>
            {/* Item 2 */}
                <div className="flex flex-row items-stretch bg-white rounded-md shadow">
                {/* Text section on right */}
                <div className="flex-1 flex flex-col justify-center px-3 py-4">
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                    الذكر عند الاحرام
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                        "سُبْحَانَ اللهِ وَالحَمْدُ للهِ وَالله أَكْبَرُ"
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                دعاء التلبية في الحج والعمرة 
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                        "لَبَّيْكَ اللَّهُمَّ لَبَّيْك، لَبّيْك لا شَرِيكَ لك لَبَّيْك إنَّ الحَمْدَ، والنِّعْمَةَ، لَكَ والمُلْك، لا شريك لك".  [البخاري (2/ 170)، ومسلم (1184)]
                    </p>
                    {/*  */}
                <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                الدعاء عند رؤية الكعبة
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                    "اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا رَبَّنَا بِالسَّلَامِ". [أبي شيبة 7/ 102، والبيهقي 5/ 73]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                الدعاء عند استلام الحجر الأسود
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                            "بِاسْمِ اللهِ وَاللهُ أَكْبَرُ". [الطبراني (862)، (863)، والبيهقي (5/ 79)]
                "لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ، اللَّهُمَّ تَصْدِيقًا بِكِتَابِكَ، وَسُنَّةِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ". [الطبراني (865)]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                الدُّعاءُ بينَ الرُّكن اليماني والحجر الأسود
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ". [أبو داود 2/179 وأحمد 3/411]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        الدعاء في الطواف
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                    "اللهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ". [الطبراني (857)، والبيهقي (5/ 84)]
                "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ".
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                الدعاء بعد ركعتي الطواف
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                        اللَّهُمَّ اعْصِمْنِي بِدِينِكَ، وَطَاعَةِ رَسُولِكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.اللَّهُمَّ جَنِّبْنِي حُدُودَكَ.
اللَّهُمَّ اجْعَلْنِي مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَرُسُلَكَ، وَعِبَادَكَ الصَّالِحِينَ اللَّهُمَّ حَبِّبْنِي إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَرُسُلِكَ، وَعِبَادَكَ الصَّالِحِينَ.
اللَّهُمَّ آتِنِي مِنْ خَيْرِ مَا تُؤْتِي عِبَادَكَ الصَّالِحِينَ فِي الدُّنْيَا وَالْآخِرَةِ.
اللَّهُمَّ يَسِّرْنِي لِلْيُسْرَى، وَجَنِّبْنِي الْعُسْرَى، وَاغْفِرْ.
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                الدعاء عند صعود الصَّفَا والمروة
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                        عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رضي الله عنه، قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ خَرَجَ مِنَ الْمَسْجِدِ يُرِيدُ الصَّفَا، يَقُولُ: "نَبْدَأُ بِمَا بَدَأَ بِهِ" فَبَدأَ بِالصَّفَا، وَقَرَأَ:   إِنَّ الصَّفَا وَالمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ وَكَانَ إِذَا وَقَفَ عَلَى الصَّفَا يُكَبِّرُ ثَلاثًا، وَيَقُولُ:
"لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ".
ثُمَّ أعاد هذا الكلام. [مسلم (1218)، وأحمد (3/ 320، 321)]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
            الدعاء على الصفا 
                    </h1>
                        <p className="md:text-xl text-gray-500 text-right">
                            "اللَّهُمَّ إِنَّكَ قُلْتَ:   اِدْعُونِي أَسْتَجِبْ لَكُمْ وَإِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ، وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي إِلَى الإِسْلاَمِ أَلاَ تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي، وَأَنَا مُسْلِمٌ".
"اللَّهُمَّ اعْصِمْنَا بِدِينِكَ، وَطَوَاعِيَتِكَ، وَطَوَاعِيَةِ رَسُولِكَ، وَجَنِّبْنَا حُدُودَكَ".
"اللَّهُمَّ اجْعَلْنَا نُحِبُّكَ، وَنُحِبُّ مَلَائِكَتَكَ، وَأَنْبِيَاءَكَ، وَرُسَلَكَ، وَنُحِبُّ عِبَادَكَ الصَّالِحِينَ".
"اللَّهُمَّ حَبِّبْنَا إِلَيْكَ وَإِلَى مَلَائِكَتِكَ، وَإِلَى أَنْبِيَائِكَ، وَرُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ".
"اللَّهُمَّ يَسِّرْنَا لِلْيُسْرَى، وَجَنِّبْنَا وَجَنِّبْنَا الْعُسْرَى، وَاغْفِرْ لَنَا فِي الْآخِرَةِ". [البيهقي (5/ 94)]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        الدعاء في السعي بين الصفا والمروة
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                        "رَبِّ اغْفِرْ وَارْحَمْ إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ". [الطبراني (870)، والبيهقي (5/ 95)]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        الدعاء بعرفات
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                    "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ". [الترمذي (3579)، والطبراني (784)]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        دعاء السلف الصالح في عرفات
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                        "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ".
"اللَّهُمَّ اهْدِنَا بِالْهُدَى، وَزَيِّنَّا بِالتَّقْوَى، وَاغْفِرْ لَنَا فِي الْآخِرَةِ وَالْأُولَى".
"ثُمَّ يَخْفِضُ صَوْتَهُ، ثُمَّ يَقُولُ: اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَعَطَائِكَ رِزْقًا طَيِّبًا مُبَارَكًا".
"اللَّهُمَّ إِنَّكَ أَمَرْتَ بِالدُّعَاءِ، وَقَضَيْتَ عَلَى نَفْسِكَ بِالِاسْتِجَابَةِ، وَأَنْتَ لَا تُخْلِفُ وَعْدَكَ، وَلَا تَكْذِبُ عَهْدَكَ، اللَّهُمَّ مَا أَحْبَبْتَ مِنْ خَيْرٍ فَحَبِّبْهُ إِلَيْنَا، وَيَسِّرْهُ لَنَا، وَمَا كَرِهْتَ مِنْ شَيْءٍ فَكَرِّهْهُ إِلَيْنَا وَجَنِّبْنَاهُ، وَلَا تَنْزِعْ عَنَّا الْإِسْلَامَ بَعْدَ إِذْ أَعْطَيْتَنَا".
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        الدعاء عند رمي جمرة العقبة عِنْدَ كُلِّ حَصَاة
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                "الله أَكْبَر، الله أَكْبَر، الله أَكْبَر".
"اللَّهُمَّ اجْعَلْهُ حَجًّا مَبْرُورًا وَذَنْبًا مَغْفُورًا". [الطبراني (881)، والبيهقي (5/ 129)]
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        الذكر عند ذبح الأضاحي
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                    بسم الله , اللهم تقبل من محمد وآل محمد ومن أمة محمد
                    </p>
                    <h1 className="py-2 text-amber-500  md:text-xl font-bold text-right tracking-wide">
                        دعاء الرجوع من الحج أو العمرة
                    </h1>
                    <p className="md:text-xl text-gray-500 text-right">
                        "الله أَكْبَر، الله أَكْبَر، الله أَكْبَر".
                "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، سَاجِدُونَ".
                "اَللّٰهُمَّ اجْعَلْهُ حَجًّا مَبْرُوْرًا وَسَعْيًا مَشْكُوْرًا وَذَنْبًا مَغْفُوْرًا".

                    </p>
                </div>
                {/* Number box on left */}
                <div className="flex items-center justify-center rounded-md bg-teal-600 md:w-[120px] w-[50px] md:h-[1500px] h-[50px] m-2">
                    <p className="font-bold text-gray-100 md:text-3xl text-lg text-center">
                        1
                    </p>
                </div>
            </div>
                {/*  */}
            </div>
        </div>
          {/* article */}
        <article className=" bg-gray-100 border border-red-500 rounded-md my-10 mx-10">
            {/* title */}
            <div className="bg-red-500 rounded-md py-3">
                <h1 className="text-center font-bold md:text-2xl text-lg text-gray-100">
                    وردك اليوم
                </h1>
            </div>
            {/*  */}
            <div className=" mx-4 my-4">
                <p className=" text-gray-500 md:text-2xl text-lg text-right p-2">
                و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ قَالَ سَمِعْتُ مُعَاذَةَ أَنَّهَا سَأَلَتْ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلَاةَ فَقَالَتْ عَائِشَةُ أَحَرُورِيَّةٌ أَنْتِ قَدْ كُنَّ نِسَاءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحِضْنَ أَفَأَمَرَهُنَّ أَنْ يَجْزِينَ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ تَعْنِي يَقْضِينَ.
                </p>
                <div className="border-b border-b-gray-300 mx-2 my-5"></div>
                <p className="text-gray-500 md:text-2xl text-lg text-right p-2">
            أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ حُصَيْنٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَتَوَضَّأَ وَاسْتَاكَ وَهُوَ يَقْرَأُ هَذِهِ الْآيَةَ حَتَّى فَرَغَ مِنْهَا  إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ  ثُمَّ صَلَّى رَكْعَتَيْنِ ثُمَّ عَادَ فَنَامَ حَتَّى سَمِعْتُ نَفْخَهُ ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَاكَ ثُمَّ صَلَّى رَكْعَتَيْنِ ثُمَّ نَامَ ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَاكَ وَصَلَّى رَكْعَتَيْنِ وَأَوْتَرَ بِثَلَاثٍ أَخْبَرَنَا مُحَمَّدُ بْنُ جَبَلَةَ قَالَ حَدَّثَنَا مَعْمَرُ بْنُ مَخْلَدٍ ثِقَةٌ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ ابْنِ عَبَّاسٍ قَالَ اسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَنَّ وَسَاقَ الْحَدِيثَ.
                </p>
                <div className="border-b border-b-gray-300 mx-2 my-5"></div>
            </div>
        </article>
    </section>
    </>
)
}

export default Hajj
